In [2]:
import pandas as pd

In [16]:
df = pd.DataFrame({
    'name':['Masha', 'Vasya', 'Edik'],
    'age':[25, 8, 48],
    'job':['Programist', 'School', 'Big Data'],
    'salary':[100, 10, 200]
}, index = ['some', 'random', 'words'])

In [17]:
df

         name  age         job  salary
some    Masha   25  Programist     100
random  Vasya    8      School      10
words    Edik   48    Big Data     200

In [18]:
name = df['name']

In [19]:
name

some      Masha
random    Vasya
words      Edik
Name: name, dtype: object

In [20]:
df [df['salary'] >= 100]

        name  age         job  salary
some   Masha   25  Programist     100
words   Edik   48    Big Data     200

In [21]:
df['salary'] *=10

In [22]:
df

         name  age         job  salary
some    Masha   25  Programist    1000
random  Vasya    8      School     100
words    Edik   48    Big Data    2000

In [23]:
df['salary'] /=2

In [25]:
df

         name  age         job  salary
some    Masha   25  Programist   500.0
random  Vasya    8      School    50.0
words    Edik   48    Big Data  1000.0

In [26]:
df.loc['some':'words']

         name  age         job  salary
some    Masha   25  Programist   500.0
random  Vasya    8      School    50.0
words    Edik   48    Big Data  1000.0

In [29]:
df.iloc[1]

name       Vasya
age            8
job       School
salary      50.0
Name: random, dtype: object

In [30]:
df.T

              some  random     words
name         Masha   Vasya      Edik
age             25       8        48
job     Programist  School  Big Data
salary       500.0    50.0    1000.0